# Erase Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyTypeSet..::..Erase Method
FamilyTypeSet Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	FamilyType item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As FamilyType _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	FamilyType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..FamilyType
# See Also
FamilyTypeSet Class
Autodesk.Revit.DB Namespace